Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
imgs (InputLayer)               [(None, 3, 16, 16, 5 0                                            
__________________________________________________________________________________________________
tf_op_layer_strided_slice_3 (Te [(None, 16, 16, 5)]  0           imgs[0][0]                       
__________________________________________________________________________________________________
tf_op_layer_strided_slice_4 (Te [(None, 16, 16, 5)]  0           imgs[0][0]                       
__________________________________________________________________________________________________
tf_op_layer_strided_slice_5 (Te [(None, 16, 16, 5)]  0           imgs[0][0]                       
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 16, 16, 15)   0           tf_op_layer_strided_slice_3[0][0]
                                                                 tf_op_layer_strided_slice_4[0][0]
                                                                 tf_op_layer_strided_slice_5[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 16, 16, 8)    488         concatenate[1][0]                
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 16, 4)    132         conv2d_1[1][0]                   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 8, 8, 4)      0           conv2d_2[1][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 8, 8, 4)      0           max_pooling2d[1][0]              
__________________________________________________________________________________________________
flatten (Flatten)               (None, 256)          0           dropout[1][0]                    
__________________________________________________________________________________________________
clearsky_ghi (InputLayer)       [(None, 4)]          0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 260)          0           flatten[1][0]                    
                                                                 clearsky_ghi[0][0]               
__________________________________________________________________________________________________
dense (Dense)                   (None, 12)           3132        concatenate_1[1][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 8)            104         dense[1][0]                      
__________________________________________________________________________________________________
output (Dense)                  (None, 4)            36          dense_1[1][0]                    
==================================================================================================
Total params: 3,892
Trainable params: 3,892
Non-trainable params: 0
__________________________________________________________________________________________________
None
